In [58]:
import pandas as pd
import numpy as np

In [59]:
data = pd.read_csv('datasets/alumnos.csv')
print(data)

       nombre  altura  peso  edad sexo
0        Hugo    1.67    60    23    h
1        Paco    1.73    83    25    h
2        Luis    1.62    70    28    h
3       Diana    1.58    58    21    m
4   Francisco    1.86    98    28    h
5      Felipe    1.79   100    26    h
6     Jacinta    1.69    62    20    m
7    Bernardo    1.60    83    31    h
8     Marisol    1.60    56    30    m
9     Facundo    1.98   112    36    h
10   Trinidad    1.72    72    21    m
11     Camila    1.63    57    26    m
12   Macarena    1.73    68    27    m
13      Diego    1.62    78    23    h
14    Gonzalo    1.58    67    22    h
15  Alejandra    1.86    74    21    m
16   Fernando    1.79    93    27    h
17   Carolina    1.60    63    28    m
18    Vicente    1.98   102    31    h
19   Benjamín    1.72    78    36    h
20     Gloria    1.58    65    23    m

In [60]:
data.head(10)

      nombre  altura  peso  edad sexo
0       Hugo    1.67    60    23    h
1       Paco    1.73    83    25    h
2       Luis    1.62    70    28    h
3      Diana    1.58    58    21    m
4  Francisco    1.86    98    28    h
5     Felipe    1.79   100    26    h
6    Jacinta    1.69    62    20    m
7   Bernardo    1.60    83    31    h
8    Marisol    1.60    56    30    m
9    Facundo    1.98   112    36    h

In [61]:
data.tail(10)

       nombre  altura  peso  edad sexo
11     Camila    1.63    57    26    m
12   Macarena    1.73    68    27    m
13      Diego    1.62    78    23    h
14    Gonzalo    1.58    67    22    h
15  Alejandra    1.86    74    21    m
16   Fernando    1.79    93    27    h
17   Carolina    1.60    63    28    m
18    Vicente    1.98   102    31    h
19   Benjamín    1.72    78    36    h
20     Gloria    1.58    65    23    m

In [62]:
data.head()

      nombre  altura  peso  edad sexo
0       Hugo    1.67    60    23    h
1       Paco    1.73    83    25    h
2       Luis    1.62    70    28    h
3      Diana    1.58    58    21    m
4  Francisco    1.86    98    28    h

In [63]:
data.shape

(21, 5)

In [64]:
data[:5]

      nombre  altura  peso  edad sexo
0       Hugo    1.67    60    23    h
1       Paco    1.73    83    25    h
2       Luis    1.62    70    28    h
3      Diana    1.58    58    21    m
4  Francisco    1.86    98    28    h

In [65]:
data[15:]

       nombre  altura  peso  edad sexo
15  Alejandra    1.86    74    21    m
16   Fernando    1.79    93    27    h
17   Carolina    1.60    63    28    m
18    Vicente    1.98   102    31    h
19   Benjamín    1.72    78    36    h
20     Gloria    1.58    65    23    m

In [66]:
data[5:10]

     nombre  altura  peso  edad sexo
5    Felipe    1.79   100    26    h
6   Jacinta    1.69    62    20    m
7  Bernardo    1.60    83    31    h
8   Marisol    1.60    56    30    m
9   Facundo    1.98   112    36    h

In [67]:
data['altura']

0     1.67
1     1.73
2     1.62
3     1.58
4     1.86
5     1.79
6     1.69
7     1.60
8     1.60
9     1.98
10    1.72
11    1.63
12    1.73
13    1.62
14    1.58
15    1.86
16    1.79
17    1.60
18    1.98
19    1.72
20    1.58
Name: altura, dtype: float64

In [68]:
print(type(data['altura']))

<class 'pandas.core.series.Series'>

In [69]:
altura = data['altura']
type(altura)

pandas.core.series.Series

In [70]:
altura[15:]

15    1.86
16    1.79
17    1.60
18    1.98
19    1.72
20    1.58
Name: altura, dtype: float64

In [71]:
altura[:16]

0     1.67
1     1.73
2     1.62
3     1.58
4     1.86
5     1.79
6     1.69
7     1.60
8     1.60
9     1.98
10    1.72
11    1.63
12    1.73
13    1.62
14    1.58
15    1.86
Name: altura, dtype: float64

In [72]:
altura.mean()

1.710952380952381

In [73]:
altura.std()

0.12573403524522553

In [74]:
altura.median()

1.69

In [75]:
altura.describe()

count    21.000000
mean      1.710952
std       0.125734
min       1.580000
25%       1.600000
50%       1.690000
75%       1.790000
max       1.980000
Name: altura, dtype: float64

In [76]:
data.describe()

          altura        peso       edad
count  21.000000   21.000000  21.000000
mean    1.710952   76.142857  26.333333
std     0.125734   16.514496   4.651165
min     1.580000   56.000000  20.000000
25%     1.600000   63.000000  23.000000
50%     1.690000   72.000000  26.000000
75%     1.790000   83.000000  28.000000
max     1.980000  112.000000  36.000000

In [77]:
data.var()

C:\Users\dmard\AppData\Local\Temp\ipykernel_14132\445316826.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.var()

altura      0.015809
peso      272.728571
edad       21.633333
dtype: float64

In [78]:
altura.var()

0.015809047619047615

In [79]:
np.var(data['altura'])

0.015056235827664395

In [80]:
for i in data['altura']:
    print(type(i), i)

<class 'float'> 1.67
<class 'float'> 1.73
<class 'float'> 1.62
<class 'float'> 1.58
<class 'float'> 1.86
<class 'float'> 1.79
<class 'float'> 1.69
<class 'float'> 1.6
<class 'float'> 1.6
<class 'float'> 1.98
<class 'float'> 1.72
<class 'float'> 1.63
<class 'float'> 1.73
<class 'float'> 1.62
<class 'float'> 1.58
<class 'float'> 1.86
<class 'float'> 1.79
<class 'float'> 1.6
<class 'float'> 1.98
<class 'float'> 1.72
<class 'float'> 1.58